{
    "navbar": {
        "heading-original-firmware": "Firmware Original",
        "item-patcher-flasher": "Patcher & Flasher",
        "item-configurator": "Configurateur",
        "heading-open-firmware": "Firmware Open Source",
        "item-flasher": "Flasher",
        "heading-resources": "Ressources",
        "item-folder-github": "GitHub",
        "heading-github-links": "Liens GitHub",
        "item-github-uvmod": "Dépôt UVMOD",
        "item-github-links": "Plus de Liens",
        "item-folder-telegram": "Telegram",
        "heading-telegram-channels": "Canaux Telegram",
        "item-telegram-en": "Groupe Anglais",
        "item-telegram-de": "Groupe Allemand",
        "item-telegram-ru": "Groupe Russe",
        "item-telegram-ua": "Groupe Ukrainien",
        "item-telegram-es": "Groupe Espagnol",
        "item-telegram-pl": "Groupe Polonais",
        "item-telegram-it": "Groupe Italien",
        "item-telegram-tr": "Groupe Turc"
    },
    "copy-warning": "Avertissement : Certaines copies de UVMOD sont conçues sans tenir compte de la sécurité. Vérifiez le dépôt original pour les liens approuvés ! Cliquez pour en savoir plus.",
    "instructions-title": "Instructions",
    "patcher-instructions-title": "Patcher & Flasher UVMOD",
    "patcher-instructions-description": "Cet outil vous permet de personnaliser le firmware original pour les radios portatives Quansheng UV-K5, UV-K6, UV-K5(8), et UV-5R Plus. Pour flasher le firmware, vous avez besoin d'un câble de programmation compatible et des pilotes nécessaires.",
    "instructions-usage": "Utilisation",
    "patcher-instructions-usage-step-1": "À droite, sélectionnez la version du firmware que vous souhaitez personnaliser. Les mods qui ne sont pas compatibles avec la version du firmware sélectionnée seront désactivés.",
    "patcher-instructions-usage-step-2": "Sélectionnez et personnalisez les mods que vous souhaitez appliquer.",
    "patcher-instructions-usage-step-3": "Cliquez sur $t(button-firmware-patch) pour générer le firmware. Vérifiez la console pour les erreurs et la taille du firmware. Si le firmware est trop grand, vous devrez supprimer les mods qui augmentent la taille.",
    "patcher-instructions-usage-step-4": "Vous pouvez maintenant enregistrer le fichier firmware. Il est compatible avec l'outil officiel de mise à jour. Si vous utilisez un navigateur Web compatible, vous pouvez également le flasher directement. Reportez-vous aux instructions de flashage ci-dessous.",
    "flasher-instructions": "Flashage direct avec UVMOD",
    "flasher-description-1": "Les navigateurs modernes basés sur Chromium tels que Chrome, Edge et Opera disposent d'une API intégrée qui permet à UVMOD de flasher directement le firmware sur la radio. C'est la manière la plus simple de flasher le firmware, mais cela ne fonctionne que sur Windows et Linux.",
    "flasher-description-2": "Sur Windows, vous avez besoin du pilote pour le câble de programmation. En général, ces câbles utilisent des puces ch340, ch341 ou cp210x. Sur Linux, le pilote est généralement inclus.",
    "flasher-instructions-step-1": "Connectez le câble de programmation à votre ordinateur et assurez-vous que les pilotes appropriés sont installés. Il devrait apparaître comme un port com.",
    "flasher-instructions-step-2": "Sur votre radio (toujours déconnectée et éteinte), maintenez enfoncé PTT (grand bouton sur le côté) et allumez la radio tout en maintenant PTT. La lampe de poche devrait s'allumer tandis que l'écran et le clavier de la radio restent éteint. Votre radio est maintenant en mode bootloader.",
    "flasher-instructions-step-3": "Connectez le câble de programmation à la radio.",
    "flasher-instructions-step-4": "Cliquez sur $t(button-firmware-flash) et attendez que le processus se termine. Vous pouvez suivre la progression dans la console.",
    "flasher-instructions-step-5": "C'est terminé, tous vos paramètres devraient être intacts.",
    "official-flasher-title": "Flashage avec le logiciel officiel",
    "official-flasher-description": "Si vous utilisez Windows, vous pouvez utiliser l'outil officiel de mise à jour. Vous pouvez le télécharger directement depuis UVMOD en utilisant le lien dans la fenêtre de la console.",
    "official-flasher-step-1": "Connectez le câble de programmation à votre ordinateur et assurez-vous que les pilotes appropriés sont installés. Dans le gestionnaire de périphériques, il devrait apparaître comme un port COM.",
    "official-flasher-step-2": "Démarrez l'outil de mise à jour, sélectionnez le port COM et cliquez sur connecter.",
    "official-flasher-step-3": "Chargez le firmware personnalisé comme fichier de mise à jour.",
    "official-flasher-step-4": "Sur votre radio (toujours déconnectée et éteinte), maintenez enfoncé PTT (grand bouton sur le côté) et allumez la radio tout en maintenant PTT. La lampe de poche devrait s'allumer tandis que l'écran et le clavier de la radio restent éteint. Votre radio est maintenant en mode bootloader.",
    "official-flasher-step-5": "Connectez le câble de programmation à la radio. Le bouton \"Mise à jour\" dans l'outil de mise à jour devrait maintenant devenir disponible.",
    "official-flasher-step-6": "Cliquez sur mettre à jour et attendez que l'outil termine.",
    "official-flasher-step-7": "C'est terminé, tous vos paramètres devraient être intacts.",
    "hidden-mods-title": "Mods Cachés",
    "hidden-mods-description": "Certains mods ne sont pas listés pour des raisons de sécurité, ils peuvent être activés ici. Veuillez considérer les avertissements suivants :",
    "hidden-mods-warning-1": "UTILISEZ LES MODS TX SEULEMENT SI VOUS COMPRENEZ LE CONCEPT DES HARMONIQUES, ET AVEZ L'ÉQUIPEMENT POUR LES FILTRER DE MANIERE APPROPRIEE !",
    "hidden-mods-warning-2": "NE TRANSMETTEZ PAS - EN AUCUN CAS - SUR LA BANDE AÉRIENNE OU INTERFÉREZ AVEC D'AUTRES INFRASTRUCTURES CRITIQUES !",
    "hidden-mods-warning-3": "La transmission sur des fréquences illégales peut entraîner de lourdes amendes ou même une peine de prison.",
    "hidden-mods-warning-4": "Le matériel radio n'est conçu que pour VHF et UHF. Des modifications matérielles et des connaissances de fond sont nécessaires pour transmettre sur d'autres bandes.",
    "hidden-mods-warning-5": "Sur des fréquences en dehors des bandes VHF et UHF, le matériel radio non modifié aura une très faible puissance de sortie et un SWR très élevé, ce qui peut endommager la radio.",
    "hidden-mods-warning-6": "Par exemple, la transmission sur les bandes CB ne transmettra presque rien sur la fréquence sélectionnée (microwatts), tout en émettant avec une puissance significative sur les harmoniques, dont beaucoup sur lesquelles il est illégale de transmettre.",
    "hidden-mods-warning-7": "Vous assumez l'entière responsabilité de vos actions !",
    "hidden-mods-hint-1": "Si vous comprenez les risques et souhaitez toujours activer ces mods, ajoutez le texte suivant à l'URL :",
    "hidden-mods-hint-2": "Les mods apparaîtront dans la liste avec une bordure et un titre rouges.",
    "mods-title": "Mods",
    "console-title": "Console",
    "console-download-updater-tool": "Télécharger l'outil de mise à jour",
    "select-stock-firmware": "Firmware d'origine : {{ version }}",
    "select-patch-universal": "Patcher pour toutes les radios",
    "select-patch-k5-k6-k58": "Patcher pour K5, K6, K5(8)",
    "select-patch-5r": "Patcher pour 5R Plus",
    "button-firmware-browse-file": "Sélectionner des fichiers...",
    "button-firmware-patch": "Patcher le firmware",
    "button-firmware-flash": "Flasher le firmware",
    "button-firmware-save": "Enregistrer le firmware",
    "log": {
        "loaded-firmware-version": "Version du firmware chargée : {{ version }}",
        "loaded-symbol-file": "{{ count }} symboles chargés.",
        "loaded-firmware-file-hint": "Veuillez sélectionner un firmware et un fichier de symboles. Reportez-vous aux instructions pour plus de détails.",
        "loaded-firmware-error": "Erreur lors du chargement du firmware, vérifiez la console du développeur pour plus de détails.",
        "loaded-symbol-error": "Erreur lors du chargement des symboles, vérifiez la console du développeur pour plus de détails.",
        "loaded-symbol-none": "Aucun symbole chargé. Seul le flashage est disponible.",
        "patched-firmware-size": "Le firmware patché utilise {{ percentage }}% de l'espace disponible ({{ current_size }}/{{ max_size }} octets).",
        "patched-firmware-size-warning": "Le firmware patché est trop grand ! Supprimez des mods ou utilisez une version de firmware différente pour réduire la taille.",
        "patched-firmware-version": "Version du firmware patché : {{ version }}",
        "bootloader-version": "Version du bootloader : {{ version }}",
        "flashing-percentage": "Flashage... {{ percentage }}%",
        "flashing-rejected": "Commande de flashage rejetée. Abandon.",
        "flashing-success": "Firmware flashé avec succès.",
        "flashing-oversize": "Le firmware est trop grand. Abandon.",
        "flashing-connecting": "Connexion au port série...",
        "flashing-connecting-failed": "Échec de la connexion au port série. Abandon.",
        "flashing-radio-detected": "Radio en mode flash détectée.",
        "flashing-radio-not-detected": "Aucune donnée reçue, la radio est-elle connectée et en mode flash ?",
        "flashing-version-check-passed": "Vérification de la version réussie.",
        "flashing-version-check-failed": "Échec de la vérification de la version. Veuillez sélectionner la version correcte. Abandon.",
        "flashing-starting": "Flashage du firmware...",
        "flashing-unexpected-packet": "Paquet inattendu reçu. La radio n'est pas prête pour le flashage. Abandon.",
        "flashing-unusual-error": "Une erreur inhabituelle s'est produite, vérifiez la console du navigateur pour plus de détails. Abandon."
    },
    "mod": {
        "common": {
            "flash-usage": "Utilisation du flash : {{ size }} octet",
            "hidden-mods-shown": "Mods cachés affichés. Veuillez lire attentivement les avertissements !",
            "mod-success": "Succès : {{ name }} appliqué.",
            "mod-error": "ERREUR dans {{ name }} : {{ error }}",
            "mods-applied": "Fin de l'application des mods...",
            "error-unexpected-data": "Données inattendues, déjà patchées ou mauvais firmware ?"
        },
        "BatteryIcon": {
            "name": "Icône de Batterie",
            "description": "Change l'icône de la batterie pour une variante à l'apparence plus classique."
        }
    }

}
